app/views/welcome/index.html.erb

    <tbody>
    <% building.rooms.each do |room| %>
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."building_id" = 1