app/controllers/welcome_controller.rb

  def index
    @northeastern = School.find(1)
---
SELECT "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]